In [20]:
import pandas as pd

In [21]:
path = './Repo/分组.xlsx'
df = pd.read_excel(path)

In [22]:
df

     学号                  时间   姓名  班级 性别  数学  语文  英语
0  A001 2020-05-01 17:00:00  丁智敏  1班  女  54  34  51
1  A002 2020-05-02 18:00:00  李平平  3班  女  68  48  41
2  A003 2020-05-02 09:00:00   张伊  2班  女  32  65  40
3  A004 2020-05-01 08:00:00   王刚  4班  男  70  50  37
4  A005 2020-05-01 17:00:00   王松  3班  男  59  55  39
5  A006 2020-05-02 18:00:00  卢海军  2班  男  56  40  39
6  A007 2020-05-01 08:00:00  李永兴  1班  男  43  53  42
7  A008 2020-05-02 09:00:00   王硕  4班  女  68  68  69
8  A009 2020-05-01 17:00:00   李超  3班  男  38  35  51
9  A010 2020-05-02 18:00:00  张荣耀  1班  男  67  65  36

In [23]:
df2 = df.groupby(df.index % 2 == 0)[['语文', '数学', '英语']].sum()

In [24]:
df2

        语文   数学   英语
False  271  329  222
True   242  226  223

In [25]:
df3 = df.groupby(df.index >= 5)['语文'].sum()
df3

False    252
True     261
Name: 语文, dtype: int64

In [26]:
# 按姓氏或首字母分组
df4 = df.groupby(df.姓名.str[0])[['语文','数学','英语']].sum()
df4

     语文   数学   英语
姓名
丁    34   54   51
卢    40   56   39
张   130   99   76
李   136  149  134
王   173  197  145

In [27]:
# 按姓名第1和第2个字母分组，注意两个str要写在列表中
df4_2 = df.groupby([df.姓名.str[0], df.姓名.str[1]])[['语文','数学','英语']].sum()
df4_2

       语文  数学  英语
姓名 姓名
丁  智   34  54  51
卢  海   40  56  39
张  伊   65  32  40
   荣   65  67  36
李  平   48  68  41
   永   53  43  42
   超   35  38  51
王  刚   50  70  37
   松   55  59  39
   硕   68  68  69

In [28]:
# 按指定班级分组（不需要全部班级时使用）
df5 = df.groupby(
    df.班级.isin(['1班', '2班'])
)[['语文', '数学', '英语']].sum()
df5

        语文   数学   英语
班级
False  256  303  237
True   257  252  208

In [29]:
# 按指定班级分组（不包括1班和2班的其它班级，记住~加的位置，没有isnotin函数）
df6 = df.groupby(~df.班级.isin(['1班','2班']))[['语文','数学','英语']].sum()
df6

        语文   数学   英语
班级
False  257  252  208
True   256  303  237

In [30]:
# 按日期小时分组
df7 = df.groupby(
    [df.时间.dt.date, df.时间.dt.hour]
)[['语文','数学','英语']].sum()
df7

                语文   数学   英语
时间         时间
2020-05-01 8   103  113   79
           17  124  151  141
2020-05-02 9   133  100  109
           18  153  191  116

In [31]:
# 按日期中的年份分组
df8 = df.groupby([df.时间.dt.year])[['语文','数学','英语']].sum()
df8

       语文   数学   英语
时间
2020  513  555  445

In [36]:
# 利用表格函数pipe直接使用分组方法
df9 = df.pipe(pd.DataFrame.groupby,'班级')['语文'].sum()
# 我們平時的寫法
# df.groupby('班级')
print(df9)

班级
1班    152
2班    105
3班    138
4班    118
Name: 语文, dtype: int64